mlcommons/tiny_results_v1.3/closed/STMicroelectronics/code/NUCLEO_U575ZI_Q/NUCLEO_U575ZI_Q.ioc
STMicroelectronics.X-CUBE-AI.10.2.0.IPParameters=HeapSize,StackSize,ModelKind-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,LatestDirectoryUsed-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelActualCompression-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelStructureFile-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,ModelRamOccupation-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelName-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,copyWeightToRam-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,LatestDirectoryUsed-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelMacc-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,ModelActualCompression-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,ModelName-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,MaximumNumberOfInputLayer,ModelType-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelStructureFile-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,MaximumNumberOfOutputLayer,LatestDirectoryUsed-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,optimization-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ReadyForCodeGeneration,customLayerConfigEnabled,useInputAllocation,ModelFlashOccupation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelRamOccupation-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,InternalRamActivationBufferMaxSize,ModelMacc-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelActualCompression-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelName-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelType-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,extraOptions-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,LatestDirectoryUsed-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,ModelStructureFile-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelCompression-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelRamOccupation-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,ActivationBufferSizeList,ModelMacc-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelStructureFile-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,ActivationBuffers,ModelName-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelType-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,ModelCompression-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelName-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,noOnnxIoTranspose,ModelFlashOccupation-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,useInputAllocation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,optimization,ModelFlashOccupation-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelKind-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelKind-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,LatestDirectoryUsed-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelFlashOccupation-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelCompression-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9,useOutputAllocation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelKind-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelHashList,ModelCompression-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,ModelMacc-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,MaximumSizeOfInputLayer,ModelActualCompression-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,ModelNameList,WorkingBufferStartAddrList,noOnnxIoTranspose-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelType-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelRamOccupation-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,customLayerConfigEnabled-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,copyWeightToRam,ModelCompression-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,MaximumSizeOfOutputLayer,ModelType-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413,ModelFlashOccupation-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,ModelKind-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,ModelActualCompression-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98,useOutputAllocation,ModelRamOccupation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,ModelMacc-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248,ModelStructureFile-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace,XAaCUBEAaAICcArtificialOoIntelligenceJjCore,ModelName-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelKind-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelCompression-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelStructureFile-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelMacc-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelActualCompression-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelRamOccupation-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelFlashOccupation-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelName-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelKind-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelCompression-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelStructureFile-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelMacc-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelActualCompression-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelRamOccupation-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelFlashOccupation-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelName-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelKind-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelCompression-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelStructureFile-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelMacc-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelActualCompression-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelRamOccupation-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelFlashOccupation-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelName-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelKind-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelCompression-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelStructureFile-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelMacc-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelActualCompression-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelRamOccupation-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelFlashOccupation-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ModelType-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf,ModelType-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc,ModelType-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a,ModelType-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d,ActivationSizes,ActivationNames
STMicroelectronics.X-CUBE-AI.10.2.0.InternalRamActivationBufferMaxSize=AI_NETWORK_VWW_DATA_ACTIVATIONS_SIZE
STMicroelectronics.X-CUBE-AI.10.2.0.LatestDirectoryUsed-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=C\:\\Users\\trillinr\\Documents\\BenchmarkModels
STMicroelectronics.X-CUBE-AI.10.2.0.LatestDirectoryUsed-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=C\:\\Users\\trillinr\\Documents\\BenchmarkModels
STMicroelectronics.X-CUBE-AI.10.2.0.LatestDirectoryUsed-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=C\:\\Users\\trillinr\\Documents\\BenchmarkModels
STMicroelectronics.X-CUBE-AI.10.2.0.LatestDirectoryUsed-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=C\:\\Users\\trillinr\\Documents\\TinyML\\tiny_master\\benchmark\\training\\streaming_wakeword\\trained_models
STMicroelectronics.X-CUBE-AI.10.2.0.LatestDirectoryUsed-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=C\:\\Users\\trillinr\\Documents\\BenchmarkModels
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumNumberOfInputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumNumberOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumSizeOfInputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.MaximumSizeOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelActualCompression-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=0.0
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelCompression-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=None
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=133409
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=287529
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=42612
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=104036
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=24368
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=82928
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=49412
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=270880
STMicroelectronics.X-CUBE-AI.10.2.0.ModelFlashOccupation-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=69046
STMicroelectronics.X-CUBE-AI.10.2.0.ModelHashList=2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace;836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf;fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc;4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a;b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelKind-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=TFLITE
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=12534896
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=265864
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=4646932
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=4646932
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=2665536
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=827256
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=827256
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=265864
STMicroelectronics.X-CUBE-AI.10.2.0.ModelMacc-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=2665536
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=network_ic
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=network_ad
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=network_vww
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=network_vww
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=network_kws
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=sww_model
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=sww_model
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=network_ad
STMicroelectronics.X-CUBE-AI.10.2.0.ModelName-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=network_kws
STMicroelectronics.X-CUBE-AI.10.2.0.ModelNameList=network_ic,network_vww,network_kws,network_ad,sww_model
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=63912
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=6544
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=58624
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=75004
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=22272
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=14944
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=10116
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=2048
STMicroelectronics.X-CUBE-AI.10.2.0.ModelRamOccupation-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=28572
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\pretrainedResnet_quant.tflite
