mlcommons/tiny_results_v1.3/closed/STMicroelectronics/code/NUCLEO_U575ZI_Q/NUCLEO_U575ZI_Q.ioc
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\ad01_int8.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\vww_96_int8.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\vww_96_int8.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\kws_ref_model.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=C\:\\Users\\trillinr\\Documents\\TinyML\\tiny_master\\benchmark\\training\\streaming_wakeword\\trained_models\\str_ww_ref_model.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=C\:\\Users\\trillinr\\Documents\\TinyML\\tiny_master\\benchmark\\training\\streaming_wakeword\\trained_models\\str_ww_ref_model.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\ad01_int8.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelStructureFile-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=C\:\\Users\\trillinr\\Documents\\BenchmarkModels\\kws_ref_model.tflite
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-4688df873a77862db913744ecf7d14583a30cecabe11b9a78c3e7fc6ea12914a=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-6e1e0147a3c460cec064ece65c6ee68a616719595583bce460e03ffc6b4d4248=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-836ecd4f5886cb1428622230bb87c510464858a4b4e4133225b0d1ca8fd443cf=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-abf26730519e7d6a984b9cb4a56be037ae744206c8b0c9a4bcf95cb7859f6413=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-b7e3430093ea819dc19e5e3ad76028b576cfff5b54382a46c0a4d6e0e501408d=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-ec385c8e0c04c383814a92e066c179f831211cb3f9ae5b5fb10b83428e2831e9=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-f81f5041ebd267de194849bf63f6caad0f61ee0edd2559d3d01b877e40435f98=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ModelType-fad26625120d55d05ee8ec957560e32e57f9365f6bf14b57aab692e5859488cc=STM32Cube.AI MCU runtime
STMicroelectronics.X-CUBE-AI.10.2.0.ReadyForCodeGeneration=true
STMicroelectronics.X-CUBE-AI.10.2.0.StackSize=0x800
STMicroelectronics.X-CUBE-AI.10.2.0.WorkingBufferStartAddrList=0xFFFFFFFF,0xFFFFFFFF,0xFFFFFFFF,0xFFFFFFFF,0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.10.2.0.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.10.2.0.copyWeightToRam=false
STMicroelectronics.X-CUBE-AI.10.2.0.copyWeightToRam-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=false
STMicroelectronics.X-CUBE-AI.10.2.0.customLayerConfigEnabled=false
STMicroelectronics.X-CUBE-AI.10.2.0.customLayerConfigEnabled-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=false
STMicroelectronics.X-CUBE-AI.10.2.0.extraOptions-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=-O time
STMicroelectronics.X-CUBE-AI.10.2.0.noOnnxIoTranspose=false
STMicroelectronics.X-CUBE-AI.10.2.0.noOnnxIoTranspose-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=false
STMicroelectronics.X-CUBE-AI.10.2.0.optimization=time
STMicroelectronics.X-CUBE-AI.10.2.0.optimization-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=time
STMicroelectronics.X-CUBE-AI.10.2.0.useInputAllocation=true
STMicroelectronics.X-CUBE-AI.10.2.0.useInputAllocation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=true
STMicroelectronics.X-CUBE-AI.10.2.0.useOutputAllocation=true
STMicroelectronics.X-CUBE-AI.10.2.0.useOutputAllocation-2c9fa43744daabb88d108daa043fa22099810dad5850caf263817e68c536bace=true
STMicroelectronics.X-CUBE-AI.10.2.0_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
USART1.BaudRate=921600
USART1.IPParameters=VirtualMode-Asynchronous,BaudRate
USART1.VirtualMode-Asynchronous=VM_ASYNC
VP_DCACHE1_VS_DCACHE.Mode=DCACHE_Activate
VP_DCACHE1_VS_DCACHE.Signal=DCACHE1_VS_DCACHE
VP_GPDMA1_VS_GPDMACH1.Mode=SIMPLEREQUEST_GPDMACH1
VP_GPDMA1_VS_GPDMACH1.Signal=GPDMA1_VS_GPDMACH1
VP_ICACHE_VS_ICACHE.Mode=DirectMappedCache
VP_ICACHE_VS_ICACHE.Signal=ICACHE_VS_ICACHE
VP_LPBAMQUEUE_VS_QUEUE.Mode=QUEUEMODE
VP_LPBAMQUEUE_VS_QUEUE.Signal=LPBAMQUEUE_VS_QUEUE
VP_MEMORYMAP_VS_MEMORYMAP.Mode=CurAppReg
VP_MEMORYMAP_VS_MEMORYMAP.Signal=MEMORYMAP_VS_MEMORYMAP
VP_PWR_VS_DBSignals.Mode=DisableDeadBatterySignals
VP_PWR_VS_DBSignals.Signal=PWR_VS_DBSignals
VP_PWR_VS_LPOM.Mode=PowerOptimisation
VP_PWR_VS_LPOM.Signal=PWR_VS_LPOM
VP_PWR_VS_SECSignals.Mode=Security/Privilege
VP_PWR_VS_SECSignals.Signal=PWR_VS_SECSignals
VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC.Mode=SAI_A_BASIC
VP_SAI1_VP_$IpInstance_SAIA_SAI_BASIC.Signal=SAI1_VP_$IpInstance_SAIA_SAI_BASIC
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.2.0.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.2.0.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_10.2.0
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
board=NUCLEO-U575ZI-Q
boardIOC=true
